{
    "message": "Found 36 books.",
    "results": [
        {
            "authors": "Michael J. Meyer",
            "excerpt": "In 1960, To Kill a Mockingbird was published t...",
            "genres": "Literary Criticism",
            "isbn": "9780810877238",
            "page_count": 292,
            "published_date": "2010-10-14",
            "publisher": "Scarecrow Press",
            "rating": 3.5,
            "summary": "In 1960, To Kill a Mockingbird was published to critical acclaim. To commemorate To Kill a Mockingbird's 50th anniversary, Michael J. Meyer has assembled a collection of new essays that celebrate this enduring work of American literature. These essays approach the novel from educational, legal, social, and thematic perspectives. Harper Lee's only novel won the Pulitzer Prize and was transformed into a beloved film starring Gregory Peck as Atticus Finch. An American classic that frequently appears in middle school and high school curriculums, the novel has been subjected to criticism for its subject matter and language. Still relevant and meaningful, To Kill a Mockingbird has nonetheless been under-appreciated by many critics. There are few books that address Lee's novel's contribution to the American canon and still fewer that offer insights that can be used by teachers and by students. These essays suggest that author Harper Lee deserves more credit for skillfully shaping a masterpiece that not only addresses the problems of the 1930s but also helps its readers see the problems and prejudices the world faces today. Intended for high school and undergraduate usage, as well as for teachers planning to use To Kill a Mockingbird in their classrooms, this collection will be a valuable resource for all teachers of American literature.",
            "thumbnail": "http://books.google.com/books/content?id=RyJtJZPX8jwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Harper Lee's To Kill a Mockingbird"
        },
        {
            "authors": "Harper Lee",
            "excerpt": "Voted America's Best-Loved Novel in PBS's The ...",
            "genres": "Fiction",
            "isbn": "9780062368683",
            "page_count": 342,
            "published_date": "2014-07-08",
            "publisher": "Harper Collins",
            "rating": 3.5,
            "summary": "Voted America's Best-Loved Novel in PBS's The Great American Read Harper Lee's Pulitzer Prize-winning masterwork of honor and injustice in the deep South—and the heroism of one man in the face of blind and violent hatred One of the most cherished stories of all time, To Kill a Mockingbird has been translated into more than forty languages, sold more than forty million copies worldwide, served as the basis for an enormously popular motion picture, and was voted one of the best novels of the twentieth century by librarians across the country. A gripping, heart-wrenching, and wholly remarkable tale of coming-of-age in a South poisoned by virulent prejudice, it views a world of great beauty and savage inequities through the eyes of a young girl, as her father—a crusading local lawyer—risks everything to defend a black man unjustly accused of a terrible crime.",
            "thumbnail": "http://books.google.com/books/content?id=PGR2AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "To Kill a Mockingbird"
        },
        {
            "authors": "Harold Bloom",
            "excerpt": "Contains essays about Harper Lee's To kill a m...",
            "genres": "Criticism",
            "isbn": "9781438139968",
            "page_count": 288,
            "published_date": "2013",
            "publisher": "Infobase Learning",
            "rating": -1.0,
            "summary": "Contains essays about Harper Lee's To kill a mockingbird, addressing the novel's characters, structure, themes, and subject matter.",
            "thumbnail": "http://books.google.com/books/content?id=0phbAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Harper Lee's To Kill a Mockingbird"
        },
        {
            "authors": "Paul Acampora",
            "excerpt": "Best friends Lucy, Elena, and Michael are exci...",
            "genres": "Juvenile Fiction",
            "isbn": "9781596437425",
            "page_count": 177,
            "published_date": "2014-05-20",
            "publisher": "Macmillan",
            "rating": 5.0,
            "summary": "Best friends Lucy, Elena, and Michael are excited to see \"To Kill A Mockingbird\" on their summer reading list. But not everyone in their class shares the same enthusiasm. So they hatch a plot to get the entire town talking about Harper Lee's classic novel.",
            "thumbnail": "http://books.google.com/books/content?id=tIpEAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "I Kill the Mockingbird"
        },
        {
            "authors": "Edgar Rice Burroughs",
            "excerpt": "Tarzan, the king of the jungle, enters an isol...",
            "genres": "Fiction",
            "isbn": "9783962559748",
            "page_count": 265,
            "published_date": "2017-10-19",
            "publisher": "Serapis Classics",
            "rating": -1.0,
            "summary": "Tarzan, the king of the jungle, enters an isolated country called Minuni, inhabited by a people four times smaller than himself, the Minunians, who live in magnificent city-states which frequently wage war against each other. Tarzan befriends the king, Adendrohahkis, and the prince, Komodoflorensal, of one such city-state, called Trohanadalmakus, and joins them in war against the onslaught of the army of Veltopismakus, their warlike neighbours.",
            "thumbnail": "http://books.google.com/books/content?id=v9R4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Tarzan and the Ant-Men (Serapis Classics)"
        },
        {
            "authors": "Jabari Asim",
            "excerpt": "“Asim has given us a book that is at once ente...",
            "genres": "Fiction",
            "isbn": "9781572847521",
            "page_count": 289,
            "published_date": "2015-05-12",
            "publisher": "Agate Publishing",
            "rating": -1.0,
            "summary": "“Asim has given us a book that is at once entertaining and evocative of a moment that truly was a turning point in black and American history.” —Chicago Tribune Jabari Asim’s debut novel returns readers to Gateway City, the fictional Midwestern city first explored in his acclaimed short story collection, Taste of Honey. Against a 1970s backdrop of rapid social and political change, Only the Strong portrays the challenges and rewards of love in a quintessential American community where heartbreak and violence are seldom far away. Moved by the death of Martin Luther King Jr., Lorenzo “Guts” Tolliver decides to abandon his career as a professional leg-breaker and pursue a life of quiet moments and generous helpings of banana pudding in the company of his new, sensuous lover. His erstwhile boss, local kingpin Ananias Goode, is also thinking about slowing down—but his tempestuous affair with Dr. Artinces Noel, a prominent pediatrician, complicates his retirement plans. Meanwhile, Charlotte Divine, the doctor’s headstrong protégée, struggles with trials of her own. With prose that’s sharp, humorous, and poetic, Asim skillfully renders a compelling portrait of urban life in the wake of the last major civil-rights bill. Massive change is afoot in America, and these characters have front-row seats. “[A] heartfelt, polyphonic ode to 1970s black America.” —The Wall Street Journal “Captivating.” —Jane Ciabattari, NPR Book Concierge: Best Books of 2015 “Incomparable charisma and verve.” —The Root, Best Fiction of 2015 “Lean, mean, and moving.” —Kirkus Reviews, Kirkus Prize nominee “Thoroughly entertaining and stylish . . . deserves favorable comparison to the works of Chester Himes and Walter Mosley.” —Publishers Weekly, starred review",
            "thumbnail": "http://books.google.com/books/content?id=TccxCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Only the Strong"
        },
        {
            "authors": "Harper Lee",
            "excerpt": "From celebrated Pulitzer Prize-winning author ...",
            "genres": "Fiction",
            "isbn": "9780062441782",
            "page_count": 548,
            "published_date": "2015-08-04",
            "publisher": "HarperCollins",
            "rating": 5.0,
            "summary": "From celebrated Pulitzer Prize-winning author Harper Lee, her bestselling novels To Kill a Mockingbird and Go Set a Watchman available together in this convenient e-book bundle. Set in the small town of Maycomb, Alabama, and featuring characters that have become indelible in American culture, Harper Lee’s beloved classic of Southern literature, To Kill a Mockingbird and its follow-up, Go Set a Watchman, offer a haunting portrait of race and class, innocence and injustice, hypocrisy and heroism, tradition and transformation in the Deep South of the 1930s and 1950s that resonates today. Enduring in vision, Harper Lee’s timeless novels illuminate the complexities of human nature and the depths of the human heart with humor, unwavering honesty, and a tender, nostalgic beauty, and will be celebrated by generations to come.",
            "thumbnail": "http://books.google.com/books/content?id=MZDBCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Harper Lee Collection E-book Bundle"
        },
        {
            "authors": "Chuck Klosterman",
            "excerpt": "An instant New York Times bestseller! From the...",
            "genres": "Social Science",
            "isbn": "9780735217973",
            "page_count": 385,
            "published_date": "2022-02-08",
            "publisher": "Penguin",
            "rating": -1.0,
            "summary": "An instant New York Times bestseller! From the bestselling author of But What if We’re Wrong, a wise and funny reckoning with the decade that gave us slacker/grunge irony about the sin of trying too hard, during the greatest shift in human consciousness of any decade in American history. It was long ago, but not as long as it seems: The Berlin Wall fell and the Twin Towers collapsed. In between, one presidential election was allegedly decided by Ross Perot while another was plausibly decided by Ralph Nader. In the beginning, almost every name and address was listed in a phone book, and everyone answered their landlines because you didn’t know who it was. By the end, exposing someone’s address was an act of emotional violence, and nobody picked up their new cell phone if they didn’t know who it was. The 90s brought about a revolution in the human condition we’re still groping to understand. Happily, Chuck Klosterman is more than up to the job. Beyond epiphenomena like \"Cop Killer\" and Titanic and Zima, there were wholesale shifts in how society was perceived: the rise of the internet, pre-9/11 politics, and the paradoxical belief that nothing was more humiliating than trying too hard. Pop culture accelerated without the aid of a machine that remembered everything, generating an odd comfort in never being certain about anything. On a 90’s Thursday night, more people watched any random episode of Seinfeld than the finale of Game of Thrones. But nobody thought that was important; if you missed it, you simply missed it. It was the last era that held to the idea of a true, hegemonic mainstream before it all began to fracture, whether you found a home in it or defined yourself against it. In The Nineties, Chuck Klosterman makes a home in all of it: the film, the music, the sports, the TV, the politics, the changes regarding race and class and sexuality, the yin/yang of Oprah and Alan Greenspan. In perhaps no other book ever written would a sentence like, “The video for ‘Smells Like Teen Spirit’ was not more consequential than the reunification of Germany” make complete sense. Chuck Klosterman has written a multi-dimensional masterpiece, a work of synthesis so smart and delightful that future historians might well refer to this entire period as Klostermanian.",
            "thumbnail": "http://books.google.com/books/content?id=rDUtEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "The Nineties"
        },
        {
            "authors": "Harper Lee",
            "excerpt": "\"Shoot all the bluejays you want, if you can h...",
            "genres": "Fiction",
            "isbn": "9780061980268",
            "page_count": 482,
            "published_date": "2010-05-11",
            "publisher": "Harper Collins",
            "rating": 4.5,
            "summary": "\"Shoot all the bluejays you want, if you can hit 'em, but remember it's a sin to kill a mockingbird.\" A lawyer's advice to his children as he defends the real mockingbird of Harper Lee's classic novel—a black man charged with the rape of a white girl. Through the young eyes of Scout and Jem Finch, Harper Lee explores with rich humor and unswerving honesty the irrationality of adult attitudes toward race and class in the Deep South of the 1930s. The conscience of a town steeped in prejudice, violence, and hypocrisy is pricked by the stamina and quiet heroism of one man's struggle for justice—but the weight of history will only tolerate so much. One of the best-loved classics of all time, To Kill a Mockingbird has earned many dis-tinctions since its original publication in 1960. It has won the Pulitzer Prize, been translated into more than forty languages, sold more than forty million copies worldwide, and been made into an enormously popular movie. It was also named the best novel of the twentieth century by librarians across the country (Library Journal). HarperCollins is proud to celebrate the fiftieth anniversary of the book's publication with this special hardcover edition.",
            "thumbnail": "http://books.google.com/books/content?id=78VrOOWSQ6UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "To Kill a Mockingbird LP"
        },
        {
            "authors": "Tom Santopietro",
            "excerpt": "Tom Santopietro, an author well-known for his ...",
            "genres": "Literary Criticism",
            "isbn": "9781250163769",
            "page_count": 270,
            "published_date": "2018-06-19",
            "publisher": "Macmillan + ORM",
            "rating": -1.0,
            "summary": "Tom Santopietro, an author well-known for his writing about American popular culture, delves into the heart of the beloved classic and shows readers why To Kill a Mockingbird matters more today than ever before. With 40 million copies sold, To Kill a Mockingbird’s poignant but clear eyed examination of human nature has cemented its status as a global classic. Tom Santopietro's new book, Why To Kill a Mockingbird Matters, takes a 360 degree look at the Mockingbird phenomenon both on page and screen. Santopietro traces the writing of To Kill a Mockingbird, the impact of the Pulitzer Prize, and investigates the claims that Lee’s book is actually racist. Here for the first time is the full behind the scenes story regarding the creation of the 1962 film, one which entered the American consciousness in a way that few other films ever have. From the earliest casting sessions to the Oscars and the 50th Anniversary screening at the White House, Santopietro examines exactly what makes the movie and Gregory Peck’s unforgettable performance as Atticus Finch so captivating. As Americans yearn for an end to divisiveness, there is no better time to look at the significance of Harper Lee's book, the film, and all that came after.",
            "thumbnail": "http://books.google.com/books/content?id=r0dBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Why to Kill a Mockingbird Matters"
        },
        {
            "authors": "Harper Lee",
            "excerpt": "#1 New York Times Bestseller “Go Set a Watchma...",
            "genres": "Fiction",
            "isbn": "9780062409874",
            "page_count": 204,
            "published_date": "2015-07-14",
            "publisher": "HarperCollins",
            "rating": 4.0,
            "summary": "#1 New York Times Bestseller “Go Set a Watchman is such an important book, perhaps the most important novel on race to come out of the white South in decades.\" — New York Times A landmark novel by Harper Lee, set two decades after her beloved Pulitzer Prize–winning masterpiece, To Kill a Mockingbird. Twenty-six-year-old Jean Louise Finch—“Scout”—returns home to Maycomb, Alabama from New York City to visit her aging father, Atticus. Set against the backdrop of the civil rights tensions and political turmoil that were transforming the South, Jean Louise’s homecoming turns bittersweet when she learns disturbing truths about her close-knit family, the town, and the people dearest to her. Memories from her childhood flood back, and her values and assumptions are thrown into doubt. Featuring many of the iconic characters from To Kill a Mockingbird, Go Set a Watchman perfectly captures a young woman, and a world, in painful yet necessary transition out of the illusions of the past—a journey that can only be guided by one’s own conscience. Written in the mid-1950s, Go Set a Watchman imparts a fuller, richer understanding and appreciation of the late Harper Lee. Here is an unforgettable novel of wisdom, humanity, passion, humor, and effortless precision—a profoundly affecting work of art that is both wonderfully evocative of another era and relevant to our own times. It not only confirms the enduring brilliance of To Kill a Mockingbird, but also serves as its essential companion, adding depth, context, and new meaning to an American classic.",
            "thumbnail": "http://books.google.com/books/content?id=OQR4BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Go Set a Watchman"
        },
        {
            "authors": "Facing History and Ourselves",
            "excerpt": "Teaching Mockingbird presents educators with t...",
            "genres": "Education",
            "isbn": "9781940457079",
            "page_count": 0,
            "published_date": "2018-01-19",
            "publisher": "Facing History & Ourselves National Foundation, Incorporated",
            "rating": -1.0,
            "summary": "Teaching Mockingbird presents educators with the materials they need to transform how they teach Harper Lee's novel To Kill a Mockingbird. Interweaving the historical context of Depression-era rural Southern life, and informed by Facing History's pedagogical approach, this resource introduces layered perspectives and thoughtful strategies into the teaching of To Kill a Mockingbird. This teacher's guide provides English language arts teachers with student handouts, close reading exercises, and connection questions that will push students to build a complex understanding of the historical realities, social dynamics, and big moral questions at the heart of To Kill a Mockingbird. Following Facing History's scope and sequence, students will consider the identities of the characters, and the social dynamics of the community of Maycomb, supplementing their understanding with deep historical exploration. They will consider challenging questions about the individual choices that determine the outcome of Tom Robinson's trial, and the importance of civic participation in the building a more just society. Teaching Mockingbird uses Facing History's guiding lens to examine To Kill a Mockingbird, offering material that will enhance student's literary skills, moral growth, and social development.",
            "thumbnail": "http://books.google.com/books/content?id=pfjRoQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "Teaching Mockingbird"
        },
        {
            "authors": "Marjorie Stelmach",
            "excerpt": "This is an idea book. It was designed for you,...",
            "genres": "",
            "isbn": "9780787780579",
            "page_count": 75,
            "published_date": "1990-09-01",
            "publisher": "Lorenz Educational Press",
            "rating": -1.0,
            "summary": "This is an idea book. It was designed for you, the literature teacher, as a time-saver that brings together key ideas, background information, and suggestions for teaching the novel successfully. Choose from the suggestions in the book to suit your style; adapt and expand on activities as they suit your students. Above all, this book is meant to be a tool to assist you in intensifying your students' involvement with the text and with the way literature helps to make sense of",
            "thumbnail": "http://books.google.com/books/content?id=HdgQvg4VY4AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "To Kill A Mockingbird (eBook)"
        },
        {
            "authors": "Pat Conroy",
            "excerpt": "A “miraculous” (Newsweek) human drama, based o...",
            "genres": "Biography & Autobiography",
            "isbn": "9780553381573",
            "page_count": 322,
            "published_date": "2002-03-26",
            "publisher": "Dial Press Trade Paperback",
            "rating": -1.0,
            "summary": "A “miraculous” (Newsweek) human drama, based on a true story, from the renowned author of The Prince of Tides and The Great Santini The island is nearly deserted, haunting, beautiful. Across a slip of ocean lies South Carolina. But for the handful of families on Yamacraw Island, America is a world away. For years the people here lived proudly from the sea, but now its waters are not safe. Waste from industry threatens their very existence unless, somehow, they can learn a new way. But they will learn nothing without someone to teach them, and their school has no teacher—until one man gives a year of his life to the island and its people. Praise for The Water Is Wide “Miraculous . . . an experience of joy.”—Newsweek “A powerfully moving book . . . You will laugh, you will weep, you will be proud and you will rail . . . and you will learn to love the man.”—Charleston News and Courier “A hell of a good story.”—The New York Times “Few novelists write as well, and none as beautifully.”—Lexington Herald-Leader “[Pat] Conroy cuts through his experiences with a sharp edge of irony. . . . He brings emotion, writing talent and anger to his story.”—Baltimore Sun",
            "thumbnail": "http://books.google.com/books/content?id=YvFk-SbHsTsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "The Water Is Wide"
        },
        {
            "authors": "Bryon Giddens-White",
            "excerpt": "Provides a background for Harper Lee's famous ...",
            "genres": "Juvenile Nonfiction",
            "isbn": "9781403482082",
            "page_count": 62,
            "published_date": "2007",
            "publisher": "Heinemann-Raintree Library",
            "rating": -1.0,
            "summary": "Provides a background for Harper Lee's famous novel by looking at relevant biographical details about her life and providing historical details that place the story in context, with a literary analysis of the novel.",
            "thumbnail": "http://books.google.com/books/content?id=5NksBmRTvl8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "The Story Behind Harper Lee's To Kill a Mockingbird"
        },
        {
            "authors": "Piper Whelan",
            "excerpt": "...",
            "genres": "American fiction",
            "isbn": "9781510511798",
            "page_count": 32,
            "published_date": "2017",
            "publisher": "",
            "rating": -1.0,
            "summary": "",
            "thumbnail": "",
            "title": "To Kill a Mockingbird"
        },
        {
            "authors": "Austin Sarat,Martha Merrill Umphrey",
            "excerpt": "Reevaluates the legal and cultural significanc...",
            "genres": "Law in literature",
            "isbn": "9781625340153",
            "page_count": 0,
            "published_date": "2013",
            "publisher": "",
            "rating": -1.0,
            "summary": "Reevaluates the legal and cultural significance of an iconic American film",
            "thumbnail": "http://books.google.com/books/content?id=MwYPlAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "Reimagining To Kill a Mockingbird"
        },
        {
            "authors": "Laura Bates",
            "excerpt": "A female professor, a super maximum security p...",
            "genres": "Biography & Autobiography",
            "isbn": "9781402273155",
            "page_count": 259,
            "published_date": "2013-04-02",
            "publisher": "Sourcebooks, Inc.",
            "rating": 3.0,
            "summary": "A female professor, a super maximum security prisoner, and how Shakespeare saved them both Shakespeare professor and prison volunteer Laura Bates thought she had seen it all. That is, until she decided to teach Shakespeare in a place the bard had never been before—supermax solitary confinement. In this unwelcoming place, surrounded by inmates known as the worst of the worst, is Larry Newton. A convicted murderer with several escape attempts under his belt and a brilliantly agile mind on his shoulders, Larry was trying to break out of prison at the same time Laura was fighting to get her program started behind bars. A testament to the power of literature, Shakespeare Saved My Life is a remarkable memoir. Fans of Orange is the New Black (Piper Kerman), A Place to Stand (Jimmy Baca) and I Couldn't Help Myself (Wally Lamb) will be be inspired by the story of the most unlikely friendship, one bonded by Shakespeare and lasting years—a friendship that would, in the end, save more than one life. What readers are saying about Shakespeare Saved My Life: \"I was tremendously moved by both the potential impact of Shakespeare and learning on human beings and the story of this one man.\" \"This is one of the most extraordinary books I've ever read.\" \"I have never read a book that touched me as much as this memoir.\" \"It is a challenging and remarkable story.\" \"I loved this book so much. It changed my life.\" What reviewers are saying about Shakespeare Saved My Life: \"You don't have to be a William Shakespeare fan, a prisoner, or a prison reformer to appreciate this uplifting book. \"Shakespeare Saved My Life\" also reveals many important truths ... about the meaning of empathy in our dealings with others\"—Finger Lake Times \"Shakespeare Saved My Life touches on the search for meaning in life, the struggles that complicate the path to triumph and the salvation that can be found in literature's great works ... An inspiring account.\"—Shelf Awareness \"Opening the mind's prison proves enormously gratifying, not to mention effective ... brave, groundbreaking work\"—Publishers Weekly \"An eye-opening study reiterating the perennial power of books, self-discipline, and the Bard of Avon.\"—Kirkus \"A powerful testament to how Shakespeare continues to speak to contemporary readers in all sorts of circumstances.\"—Booklist",
            "thumbnail": "http://books.google.com/books/content?id=EfrjBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Shakespeare Saved My Life"
        },
        {
            "authors": "Harper Lee",
            "excerpt": "Plot synopsis of this classic is made meaningf...",
            "genres": "Literary Criticism",
            "isbn": "9780812034462",
            "page_count": 116,
            "published_date": "1984-10-01",
            "publisher": "Barrons Educational Services",
            "rating": -1.0,
            "summary": "Plot synopsis of this classic is made meaningful with analysis and quotes by noted literary critics, summaries of the work's main themes and characters, a sketch of the author's life and times, a bibliography, suggested test questions, and ideas for essays and term papers.",
            "thumbnail": "http://books.google.com/books/content?id=1vf9RJL3PpgC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "To Kill A Mockingbird"
        },
        {
            "authors": "Marlon James",
            "excerpt": "A tale inspired by the 1976 attempted assassin...",
            "genres": "Fiction",
            "isbn": "9781594633942",
            "page_count": 706,
            "published_date": "2015-09-08",
            "publisher": "Riverhead Books",
            "rating": -1.0,
            "summary": "A tale inspired by the 1976 attempted assassination of Bob Marley spans decades and continents to explore the experiences of journalists, drug dealers, killers, and ghosts against a backdrop of social and political turmoil.",
            "thumbnail": "http://books.google.com/books/content?id=mNzZCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "A Brief History of Seven Killings"
        },
        {
            "authors": "Marja Mills",
            "excerpt": "To Kill a Mockingbird by Harper Lee is one of ...",
            "genres": "Biography & Autobiography",
            "isbn": "9780698163836",
            "page_count": 288,
            "published_date": "2014-07-15",
            "publisher": "Penguin",
            "rating": 5.0,
            "summary": "To Kill a Mockingbird by Harper Lee is one of the best loved novels of the twentieth century. But for the last fifty years, the novel’s celebrated author, Harper Lee, has said almost nothing on the record. Journalists have trekked to her hometown of Monroeville, Alabama, where Harper Lee, known to her friends as Nelle, has lived with her sister, Alice, for decades, trying and failing to get an interview with the author. But in 2001, the Lee sisters opened their door to Chicago Tribune journalist Marja Mills. It was the beginning of a long conversation—and a great friendship. In 2004, with the Lees’ blessing, Mills moved into the house next door to the sisters. She spent the next eighteen months there, sharing coffee at McDonalds and trips to the Laundromat with Nelle, feeding the ducks and going out for catfish supper with the sisters, and exploring all over lower Alabama with the Lees’ inner circle of friends. Nelle shared her love of history, literature, and the Southern way of life with Mills, as well as her keen sense of how journalism should be practiced. As the sisters decided to let Mills tell their story, Nelle helped make sure she was getting the story—and the South—right. Alice, the keeper of the Lee family history, shared the stories of their family. The Mockingbird Next Door is the story of Mills’s friendship with the Lee sisters. It is a testament to the great intelligence, sharp wit, and tremendous storytelling power of these two women, especially that of Nelle. Mills was given a rare opportunity to know Nelle Harper Lee, to be part of the Lees’ life in Alabama, and to hear them reflect on their upbringing, their corner of the Deep South, how To Kill a Mockingbird affected their lives, and why Nelle Harper Lee chose to never write another novel.",
            "thumbnail": "http://books.google.com/books/content?id=WL1UAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "The Mockingbird Next Door"
        },
        {
            "authors": "Bebe Moore Campbell",
            "excerpt": "\"ABSORBING...COMPELLING...HIGHLY SATISFYING.\" ...",
            "genres": "Fiction",
            "isbn": "9780345401120",
            "page_count": 450,
            "published_date": "1995-06-27",
            "publisher": "One World",
            "rating": -1.0,
            "summary": "\"ABSORBING...COMPELLING...HIGHLY SATISFYING.\" --San Francisco Chronicle \"TRULY ENGAGING...Campbell has a storyteller's ear for dialogue and the visual sense of painting a picture and a place....There's a steam that keeps the story moving as the characters, and later their children, wrestle through racial, personal and cultural crisis.\" --Los Angeles Times Book Review \"REMARKABLE...POWERFUL.\" --Time \"YOUR BLUES AIN'T LIKE MINE is rich, lush fiction set in rural Mississippi beginning in the mid-'50s. It is also a haunting reality flowing through Anywhere, U.S.A., in the '90s....There's love, rage and hatred, winning and losing, honor, abuse; in other words, humanity....Campbell now deserves recognition as the best of storytellers. Her writing sings.\" --The Indianapolis News \"EXTRAORDINDARY.\" --The Seattle Times \"A COMPELLING NARRATIVE...Campbell is a master when it comes to telling a story.\" --Entertainment Weekly YOUR BLUES AIN'T LIKE MINE won the NAACP Image Award for Best Literary Work of Fiction",
            "thumbnail": "http://books.google.com/books/content?id=o_9MDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Your Blues Ain't Like Mine"
        },
        {
            "authors": "Joseph Crespino",
            "excerpt": "Who was the real Atticus Finch? A prize-winnin...",
            "genres": "Biography & Autobiography",
            "isbn": "9781541644953",
            "page_count": 272,
            "published_date": "2018-05-08",
            "publisher": "Basic Books",
            "rating": -1.0,
            "summary": "Who was the real Atticus Finch? A prize-winning historian reveals the man behind the legend The publication of Go Set a Watchman in 2015 forever changed how we think about Atticus Finch. Once seen as a paragon of decency, he was reduced to a small-town racist. How are we to understand this transformation? In Atticus Finch, historian Joseph Crespino draws on exclusive sources to reveal how Harper Lee's father provided the central inspiration for each of her books. A lawyer and newspaperman, A. C. Lee was a principled opponent of mob rule, yet he was also a racial paternalist. Harper Lee created the Atticus of Watchman out of the ambivalence she felt toward white southerners like him. But when a militant segregationist movement arose that mocked his values, she revised the character in To Kill a Mockingbird to defend her father and to remind the South of its best traditions. A story of family and literature amid the upheavals of the twentieth century, Atticus Finch is essential to understanding Harper Lee, her novels, and her times.",
            "thumbnail": "http://books.google.com/books/content?id=XQU0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Atticus Finch"
        },
        {
            "authors": "Robert F. Schulkers",
            "excerpt": "Everyone thought Stoner's Boy was dead. Seckat...",
            "genres": "Juvenile Fiction",
            "isbn": "9780813167954",
            "page_count": 352,
            "published_date": "2016-10-28",
            "publisher": "University Press of Kentucky",
            "rating": -1.0,
            "summary": "Everyone thought Stoner's Boy was dead. Seckatary Hawkins and the other boys saw him take that terrible fall into the cliff cave abyss. But the masked marauder known as the Gray Ghost is back -- running the river and causing mischief... or is he? It's not altogether clear whether or not someone from the old Red Runner gang, either Androfski the Silent or Jude the Fifth, is masquerading as the Fair and Square Club's old archenemy to hide from the law. Plus, there's a new boy in town named Simon Bleaker who seems just as rotten and wily as Stoner's Boy ever was. Will Seck and his friends be able to solve the mystery in time and bring peace back to the riverbank? Before Nancy Drew and the Hardy Boys, Seckatary Hawkins and his friends were solving mysteries and thrilling readers with tales of adventure, loyalty, and courage. One of the biggest fans of the series was author Harper Lee, and she ends her masterpiece To Kill a Mockingbird with a quote from The Gray Ghost. Now, the tales of the Fair and Square Club's encounters with the river renegade are back in print and ready to ignite the imaginations of devoted fans and new readers of all ages.",
            "thumbnail": "http://books.google.com/books/content?id=ae4lDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "The Gray Ghost"
        },
        {
            "authors": "Carmel Waldron",
            "excerpt": "Easy to use in the classroom or as a tool for ...",
            "genres": "Juvenile Nonfiction",
            "isbn": "9780198369233",
            "page_count": 84,
            "published_date": "2015-07-23",
            "publisher": "Oxford University Press - Children",
            "rating": -1.0,
            "summary": "Easy to use in the classroom or as a tool for revision, the Oxford Literature Companions provide student-friendly analysis of a range of popular set texts. Each book offers a lively, engaging approach to the text, covering context, language, characters and themes, with clear advice for assessment, examples of questions and annotated sample answers. This guide covers To Kill a Mockingbird by Harper Lee.",
            "thumbnail": "http://books.google.com/books/content?id=bM3KDwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "Oxford Literature Companions: To Kill a Mockingbird"
        },
        {
            "authors": "Jacqueline Woodson",
            "excerpt": "A powerfully moving novel from a three-time Ne...",
            "genres": "Juvenile Fiction",
            "isbn": "9780142415511",
            "page_count": 225,
            "published_date": "2010-01-07",
            "publisher": "Penguin",
            "rating": -1.0,
            "summary": "A powerfully moving novel from a three-time Newbery Honor-winning author Evie Thomas is not who she used to be. Once she had a best friend, a happy home and a loving grandmother living nearby. Once her name was Toswiah. Now, everything is different. Her family has been forced to move to a new place and change their identities. But that's not all that has changed. Her once lively father has become depressed and quiet. Her mother leaves teaching behind and clings to a new-found religion. Her only sister is making secret plans to leave. And Evie, struggling to find her way in a new city where kids aren't friendly and the terrain is as unfamiliar as her name, wonders who she is. Jacqueline Woodson weaves a fascinating portrait of a thoughtful young girl's coming of age in a world turned upside down A National Book Award Finalist",
            "thumbnail": "http://books.google.com/books/content?id=4y9nEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Hush"
        },
        {
            "authors": "Suzanne Collins",
            "excerpt": "Ambition will fuel him. Competition will drive...",
            "genres": "Young Adult Fiction",
            "isbn": "9781338635188",
            "page_count": 747,
            "published_date": "2020-05-19",
            "publisher": "Scholastic Inc.",
            "rating": 5.0,
            "summary": "Ambition will fuel him. Competition will drive him. But power has its price. It is the morning of the reaping that will kick off the tenth annual Hunger Games. In the Capitol, eighteen-year-old Coriolanus Snow is preparing for his one shot at glory as a mentor in the Games. The once-mighty house of Snow has fallen on hard times, its fate hanging on the slender chance that Coriolanus will be able to outcharm, outwit, and outmaneuver his fellow students to mentor the winning tribute. The odds are against him. He's been given the humiliating assignment of mentoring the female tribute from District 12, the lowest of the low. Their fates are now completely intertwined - every choice Coriolanus makes could lead to favor or failure, triumph or ruin. Inside the arena, it will be a fight to the death. Outside the arena, Coriolanus starts to feel for his doomed tribute . . . and must weigh his need to follow the rules against his desire to survive no matter what it takes.",
            "thumbnail": "http://books.google.com/books/content?id=NrahDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "The Ballad of Songbirds and Snakes (A Hunger Games Novel)"
        },
        {
            "authors": "Harper Lee",
            "excerpt": "Theatre program....",
            "genres": "Fiction",
            "isbn": "9780099466734",
            "page_count": 323,
            "published_date": "1960",
            "publisher": "Random House",
            "rating": -1.0,
            "summary": "Theatre program.",
            "thumbnail": "http://books.google.com/books/content?id=JQGv8eqVMrMC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "To Kill a Mockingbird"
        },
        {
            "authors": "Asphyxia",
            "excerpt": "Part coming of age, part call to action, this ...",
            "genres": "Young Adult Fiction",
            "isbn": "9781773215303",
            "page_count": 327,
            "published_date": "2021-11-09",
            "publisher": "Annick Press",
            "rating": -1.0,
            "summary": "Part coming of age, part call to action, this fast-paced #ownvoices novel about a Deaf teenager is a unique and inspiring exploration of what it means to belong. Smart, artistic, and independent, sixteen year old Piper is tired of trying to conform. Her mom wants her to be “normal,” to pass as hearing, to get a good job. But in a time of food scarcity, environmental collapse, and political corruption, Piper has other things on her mind—like survival. Piper has always been told that she needs to compensate for her Deafness in a world made for those who can hear. But when she meets Marley, a new world opens up—one where Deafness is something to celebrate, and where resilience means taking action, building a com-munity, and believing in something better. Published to rave reviews as Future Girl in Australia (Allen & Unwin, Sept. 2020), this empowering, unforgettable story is told through a visual extravaganza of text, paint, collage, and drawings. Set in an ominously prescient near future, The Words in My Hands is very much a novel for our turbulent times.",
            "thumbnail": "http://books.google.com/books/content?id=CyxQEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "The Words in My Hands"
        },
        {
            "authors": "Casey Cep",
            "excerpt": "NEW YORK TIMES BESTSELLER • This “superbly wri...",
            "genres": "Biography & Autobiography",
            "isbn": "9781101947876",
            "page_count": 348,
            "published_date": "2019-05-07",
            "publisher": "Vintage",
            "rating": -1.0,
            "summary": "NEW YORK TIMES BESTSELLER • This “superbly written true-crime story” (The New York Times Book Review) masterfully brings together the tales of a serial killer in 1970s Alabama and of Harper Lee, the beloved author of To Kill a Mockingbird, who tried to write his story. Reverend Willie Maxwell was a rural preacher accused of murdering five of his family members, but with the help of a savvy lawyer, he escaped justice for years until a relative assassinated him at the funeral of his last victim. Despite hundreds of witnesses, Maxwell’s murderer was acquitted—thanks to the same attorney who had previously defended the reverend himself. Sitting in the audience during the vigilante’s trial was Harper Lee, who spent a year in town reporting on the Maxwell case and many more trying to finish the book she called The Reverend. Cep brings this remarkable story to life, from the horrifying murders to the courtroom drama to the racial politics of the Deep South, while offering a deeply moving portrait of one of our most revered writers.",
            "thumbnail": "http://books.google.com/books/content?id=paBtDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Furious Hours"
        },
        {
            "authors": "Bethany Hegedus",
            "excerpt": "The inspiring true story of Harper Lee, the gi...",
            "genres": "Juvenile Nonfiction",
            "isbn": "9780062456700",
            "page_count": 40,
            "published_date": "2018-01-23",
            "publisher": "Balzer + Bray",
            "rating": -1.0,
            "summary": "The inspiring true story of Harper Lee, the girl who grew up to write To Kill a Mockingbird, from Bethany Hegedus and Erin McGuire. Perfect for fans of The Right Word and I Dissent. Nelle Harper Lee grew up in the rocky red soil of Monroeville, Alabama. From the get-go she was a spitfire. Unlike most girls at that time and place, Nelle preferred overalls to dresses and climbing trees to tea parties. Nelle loved to watch her daddy try cases in the courtroom. And she and her best friend, Tru, devoured books and wrote stories of their own. More than anything Nelle loved words. This love eventually took her all the way to New York City, where she dreamed of becoming a writer. Any chance she had, Nelle sat at her typewriter, writing, revising, and chasing her dream. Nelle wouldn’t give up—not until she discovered the right story, the one she was born to tell. Finally, that story came to her, and Nelle, inspired by her childhood, penned To Kill a Mockingbird. A groundbreaking book about small-town injustice that has sold over forty million copies, Nelle’s novel resonated with readers the world over, who, through reading, learned what it was like to climb into someone else’s skin and walk around in it.",
            "thumbnail": "http://books.google.com/books/content?id=CwBFswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "Alabama Spitfire: The Story of Harper Lee and To Kill a Mockingbird"
        },
        {
            "authors": "Intelligent Education",
            "excerpt": "A comprehensive study guide offering in-depth ...",
            "genres": "Study Aids",
            "isbn": "9781645421832",
            "page_count": 80,
            "published_date": "2020-02-15",
            "publisher": "Influence Publishers",
            "rating": -1.0,
            "summary": "A comprehensive study guide offering in-depth explanation, essay, and test prep for Harper Lee’s To Kill a Mockingbird, winner of the Pulitzer Prize in 1961. As a novel of the Civil Rights era, To Kill a Mockingbird tells the story of a lawyer who represented an African American accused of rape. Moreover, Lee weaves the theme of honor throughout the book and explores human dignity through her debut novel. This Bright Notes Study Guide explores the context and history of Lee’s classic work, helping students to thoroughly explore the reasons it has stood the literary test of time. Each Bright Notes Study Guide contains: - Introductions to the Author and the Work - Character Summaries - Plot Guides - Section and Chapter Overviews - Test Essay and Study Q&As The Bright Notes Study Guide series offers an in-depth tour of more than 275 classic works of literature, exploring characters, critical commentary, historical background, plots, and themes. This set of study guides encourages readers to dig deeper in their understanding by including essay questions and answers as well as topics for further research.",
            "thumbnail": "http://books.google.com/books/content?id=K7rPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Study Guide to To Kill a Mockingbird by Harper Lee"
        },
        {
            "authors": "Philip Pullman",
            "excerpt": "An unforgettable graphic novel of time travel ...",
            "genres": "Juvenile Fiction",
            "isbn": "9781338166590",
            "page_count": 164,
            "published_date": "2017-05-30",
            "publisher": "Scholastic Inc.",
            "rating": -1.0,
            "summary": "An unforgettable graphic novel of time travel and adventure on the high seas from the #1 international bestselling author of the His Dark Materials series. Trapped in the mists of time by a terrible research experiment gone wrong, John Blake and his mysterious ship are doomed to sail between the centuries, searching for a way home. In the ocean of the modern day, John rescues a shipwrecked young girl his own age, Serena, and promises to help. But returning Serena to her own time means traveling to the one place where the ship is in most danger of destruction. The all-powerful Dahlberg Corporation has an ambitious leader with plans far greater and more terrible than anyone has realized, and he is hot on their trail. For only John, Serena, and the crew know Dahlberg’s true intentions, and only they have the power to stop him from bending the world to his will . . . Praise for The Adventures of John Blake “With obvious affection for Tintin, Pullman threads this complicated skein of plot with customary measures of awe and menace . . . he proves an expert visual storyteller. Fordham animates with characters who have the detail and agility of a Studio Ghibli cast . . . Anything new from Pullman is big news, and his first original graphic novel won’t disappoint.” —Booklist, starred review “The various plot threads coalesce into a powerful tale, with the artwork creating a soaring, cinematic feel. A modern seafaring epic, highly recommended for all Pullman and fantasy fans and more than worthy of its author’s oeuvre.” —School Library Journal, starred review “Purloined technology, time travelers, ghost ships, and deception converge in this graphic page-turner . . . A richly imagined high-octane thriller.” —Kirkus Reviews “The graphic novel format lets Pullman’s . . . dialogue shine, and Fordham’s lucid panels are strong, legible, and charged with energy.” —Publishers Weekly",
            "thumbnail": "http://books.google.com/books/content?id=Tf5rDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "The Adventures of John Blake"
        },
        {
            "authors": "Catriona Mills",
            "excerpt": "Insight Study Guides are written by experts an...",
            "genres": "Education",
            "isbn": "9781921411687",
            "page_count": 75,
            "published_date": "2011-08",
            "publisher": "Insight Publications",
            "rating": -1.0,
            "summary": "Insight Study Guides are written by experts and cover a range of popular literature, plays and films. Designed to provide insight and an overview about each text for students and teachers, these guides endeavor to develop knowledge and understanding rather than just provide answers and summaries.",
            "thumbnail": "http://books.google.com/books/content?id=e9NBjdlSBMUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Harper Lee's To Kill a Mockingbird"
        },
        {
            "authors": "Elizabeth Berg",
            "excerpt": "On the hot Texas army base she calls home, Kat...",
            "genres": "Fiction",
            "isbn": "9780307763396",
            "page_count": 225,
            "published_date": "2010-12-15",
            "publisher": "Ballantine Books",
            "rating": -1.0,
            "summary": "On the hot Texas army base she calls home, Katie spends the lazy days of her summer waiting: waiting to grow up; waiting for Dickie Mack to fall in love with her; waiting for her breasts to blossom; waiting for the beatings to stop. Since their mother died, Katie and her older sister, Diane, have struggled to understand their increasingly distant, often violent father. While Diane escapes into the arms of her boyfriend, Katie hides in her room or escapes to her best friend’s house—until Katie’s admiration for her strong-willed sister leads her on an adventure that transforms her life. Written with an unerring ability to capture the sadness of growth, the pain of change, the nearly visible vibrations that connect people, this beautiful novel by the bestselling author of Open House reminds us how wonderful—and wounding—a deeper understanding of life can be.",
            "thumbnail": "http://books.google.com/books/content?id=aGBv0xpD-X8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Durable Goods"
        },
        {
            "authors": "Jean Armstrong",
            "excerpt": "...",
            "genres": "Language Arts & Disciplines",
            "isbn": "9780333398548",
            "page_count": 0,
            "published_date": "1987-10-23",
            "publisher": "Red Globe Press",
            "rating": -1.0,
            "summary": "",
            "thumbnail": "http://books.google.com/books/content?id=jkJGEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "To Kill a Mockingbird by Harper Lee"
        }
    ],
    "resultsCount": 36
}