{
  "message": "Found 24 books.",
  "results": [
      {
          "authors": "George Orwell",
          "excerpt": "A PBS Great American Read Top 100 Pick With ex...",
          "genres": "Fiction",
          "isbn": "9780547249643",
          "page_count": 309,
          "published_date": "2013-09-03",
          "publisher": "HarperCollins",
          "rating": 4.5,
          "summary": "A PBS Great American Read Top 100 Pick With extraordinary relevance and renewed popularity, George Orwell’s 1984 takes on new life in this edition. “Orwell saw, to his credit, that the act of falsifying reality is only secondarily a way of changing perceptions. It is, above all, a way of asserting power.”—The New Yorker In 1984, London is a grim city in the totalitarian state of Oceania where Big Brother is always watching you and the Thought Police can practically read your mind. Winston Smith is a man in grave danger for the simple reason that his memory still functions. Drawn into a forbidden love affair, Winston finds the courage to join a secret revolutionary organization called The Brotherhood, dedicated to the destruction of the Party. Together with his beloved Julia, he hazards his life in a deadly match against the powers that be. Lionel Trilling said of Orwell’s masterpiece, “1984 is a profound, terrifying, and wholly fascinating book. It is a fantasy of the political future, and like any such fantasy, serves its author as a magnifying device for an examination of the present.” Though the year 1984 now exists in the past, Orwell’s novel remains an urgent call for the individual willing to speak truth to power.",
          "thumbnail": "http://books.google.com/books/content?id=kotPYEqx7kMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "1984"
      },
      {
          "authors": "George Orwell",
          "excerpt": "A compilation of personal letters creates an a...",
          "genres": "Biography & Autobiography",
          "isbn": "9780871404626",
          "page_count": 569,
          "published_date": "2013-08-12",
          "publisher": "W. W. Norton & Company",
          "rating": "",
          "summary": "A compilation of personal letters creates an autobiography of the author of \"Nineteen Eighty-Four\" through his correspondence with other literary luminaries, including T.S. Eliot and Henry Miller, as well as letters to complete strangers.",
          "thumbnail": "http://books.google.com/books/content?id=_WE4AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "George Orwell: A Life in Letters"
      },
      {
          "authors": "George Orwell",
          "excerpt": "This Excellent Collection brings together Orwe...",
          "genres": "Fiction",
          "isbn": "9786257287159",
          "page_count": 2100,
          "published_date": "2024-01-18",
          "publisher": "E-Kitap Projesi & Cheapest Books",
          "rating": "",
          "summary": "This Excellent Collection brings together Orwell's longer, major books and a fine selection of shorter pieces. With great originality and wit Orwell unfolds his views on subjects ranging from a revaluation of Charles Dickens to the nature of Socialism, from a comic yet profound discussion of naughty seaside postcards to a spirited defence of English cooking. Displaying an almost unrivalled mastery of English plain prose, Orwell's Books created a unique literary manner from the process of thinking aloud and continue to challenge, move and entertain. This Books created and collected in George Orwell's Most important Works illuminate the life and work of one of the most individual writers of the XX century - a man who elevated political writing to an art. This Collection included: · 1984 · ANIMAL FARM · A CLERGYMAN'S DAUGHTER · BURMESE DAYS · COMING UP FOR AIR · DOWN AND OUT IN PARIS AND LONDON · HOMAGE TO CATALONIA · KEEP THE ASPIDISTRA FLYING · LOOKING BACK ON THE SPANISH WAR · THE LION AND THE UNICORN · THE ROAD TO WIGAN PIER",
          "thumbnail": "http://books.google.com/books/content?id=yDbuEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "George Orwell Collection"
      },
      {
          "authors": "Sylvia Topp",
          "excerpt": "This is the never-before-told story of George ...",
          "genres": "Biography & Autobiography",
          "isbn": "9781783527502",
          "page_count": 514,
          "published_date": "2020-03-05",
          "publisher": "Unbound Publishing",
          "rating": 5,
          "summary": "This is the never-before-told story of George Orwell's first wife, Eileen, a woman who shaped, supported, and even saved the life of one of the twentieth century's greatest writers. In 1934, Eileen O'Shaughnessy's futuristic poem, 'End of the Century, 1984', was published. The next year, she would meet George Orwell, then known as Eric Blair, at a party. 'Now that is the kind of girl I would like to marry!' he remarked that night. Years later, Orwell would name his greatest work, Nineteen Eighty-Four, in homage to the memory of Eileen, the woman who shaped his life and his art in ways that have never been acknowledged by history, until now. From the time they spent in a tiny village tending goats and chickens, through the Spanish Civil War, to the couple's narrow escape from the destruction of their London flat during a German bombing raid, and their adoption of a baby boy, Eileen is the first account of the Blairs' nine-year marriage. It is also a vivid picture of bohemianism, political engagement, and sexual freedom in the 1930s and '40s. Through impressive depth of research, illustrated throughout with photos and images from the time, this captivating and inspiring biography offers a completely new perspective on Orwell himself, and most importantly tells the life story of an exceptional woman who has been unjustly overlooked.",
          "thumbnail": "http://books.google.com/books/content?id=UF6vDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "Eileen"
      },
      {
          "authors": "John Rodden,John Rossi",
          "excerpt": "Arguably the most influential political writer...",
          "genres": "Literary Criticism",
          "isbn": "9781107376878",
          "page_count": 147,
          "published_date": "2012-06-07",
          "publisher": "Cambridge University Press",
          "rating": "",
          "summary": "Arguably the most influential political writer of the twentieth century, George Orwell remains a crucial voice for our times. Known world-wide for his two best-selling masterpieces Nineteen Eighty-Four, a gripping portrait of a dystopian future, and Animal Farm, a brilliant satire on the Russian Revolution, Orwell has been revered as an essayist, journalist and literary-political intellectual, and his works have exerted a powerful international impact on the post-World War Two era. This Introduction examines Orwell's life, work and legacy, addressing his towering achievement and his ongoing appeal. Combining important biographical detail with close analysis of his writings, the book considers the various genres in which Orwell wrote: the realistic novel, the essay, journalism and the anti-utopia. Ideally suited for readers approaching Orwell's work for the first time, the book concludes with an extended reflection on why George Orwell has enjoyed a literary afterlife unprecedented among modern authors in any language.",
          "thumbnail": "http://books.google.com/books/content?id=LNsgAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "The Cambridge Introduction to George Orwell"
      },
      {
          "authors": "Christopher Hollis",
          "excerpt": "Author Christopher Hollis knew George Orwell p...",
          "genres": "Literary Criticism",
          "isbn": "9781631582240",
          "page_count": 310,
          "published_date": "2017-06-20",
          "publisher": "Skyhorse",
          "rating": "",
          "summary": "Author Christopher Hollis knew George Orwell personally during his schooldays at Eton, afterwards in Burma, and at the end of his life. His study of Orwell’s books is therefore illuminated by some anecdotes of reminiscence. However, it is important to note that this book is primarily a study rather than a biography. Hollis examines Orwell’s books in order and traces through them the development of this unmatched literary giant’s thought process. From the experiences described in Down and Out in Paris and London to the points in his life that began driving him toward socialism, A Study of George Orwell is a comprehensive overview of Orwell’s work as it related to his personal life. Hollis guides the reader all the way through Orwell’s oeuvre, including his two most famous books—Animal Farm and 1984—which are, arguably, the greatest literary protests of political power and tyranny ever penned. Portraying Orwell as a fearless champion of the common man and a follower in the footsteps of Jonathan Swift, Hollis offers a compelling review and analysis of Orwell’s work as well as a perspective not found by the average, distant biographer",
          "thumbnail": "http://books.google.com/books/content?id=_z9wEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "A Study of George Orwell"
      },
      {
          "authors": "George Orwell",
          "excerpt": "The animals of Manor Farm have revolted and ta...",
          "genres": "Fiction",
          "isbn": "9781443411073",
          "page_count": 107,
          "published_date": "2011-10-11",
          "publisher": "Harper Collins",
          "rating": 4,
          "summary": "The animals of Manor Farm have revolted and taken over. Upon the death of Old Major, pigs Snowball and Napoleon lead a revolt against Mr. Jones, driving him from the farm. The animals embrace the Seven Commandments of Animalism and life carries on, but they learn that a farm ruled by animals looks more human than ever. HarperPerennial Classics brings great works of literature to life in digital format, upholding the highest standards in ebook production and celebrating reading in all its forms. Look for more titles in the HarperPerennial Classics collection to build your digital library.",
          "thumbnail": "http://books.google.com/books/content?id=zsF8xwh6N_MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "Animal Farm"
      },
      {
          "authors": "George Orwell",
          "excerpt": "Spanning a period of 20 months, this volume is...",
          "genres": "Authors, English",
          "isbn": "9780436205408",
          "page_count": 610,
          "published_date": "2000",
          "publisher": "Random House",
          "rating": "",
          "summary": "Spanning a period of 20 months, this volume is part of The Complete Works of George Orwell, available as a separate book. It includes essays, film, book and theatre reviews and the transcripts of a series of broadcasts on literary criticism.",
          "thumbnail": "http://books.google.com/books/content?id=cbyY4KhFYGQC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "title": "A Patriot After All, 1940-1941"
      },
      {
          "authors": "Tanya Agathocleous",
          "excerpt": "George Orwell (1903-1950) is remembered mainly...",
          "genres": "Juvenile Nonfiction",
          "isbn": "9780195121858",
          "page_count": 113,
          "published_date": "2000-06-22",
          "publisher": "Oxford University Press",
          "rating": "",
          "summary": "George Orwell (1903-1950) is remembered mainly as the author of two of the most powerful, cogent social critiques ever written: Animal Farm (1945) and 1984 (1948). Less known is the turbulent life story of the popular novelist, from his birth in India as Eric Arthur Blair to his struggle to complete 1984 while suffering from tuberculosis, the disease that would kill him two years after the book's publication.An original, independent spirit, Orwell chose an unusual career for an Eton graduate--he joined the Indian Imperial Police in Burma. Five years later, he came back to Europe and lived in both Paris and London, investigating the lives of the underprivileged and often sharing their experiences firsthand by living as a tramp. He fought against Fascism in the Spanish Civil War and simultaneously honed his writing skills while working as a journalist. Eventually he turned to writing as a full-time occupation, drawing on his varied experiences to recreate the precise details for which his novels are famous. Tanya Agathocleous's concise biography is enhanced by sidebars and picture captions which include numerous excerpts from Orwell's journalistic and literary writings. A final chapter explores Orwell's cultural legacy--his lasting contributions to freedom of thought throughout the world.",
          "thumbnail": "http://books.google.com/books/content?id=HPEmeg57VfcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "George Orwell"
      },
      {
          "authors": "Bernard Crick",
          "excerpt": "This is the biography of the English novelist ...",
          "genres": "Authors, English",
          "isbn": "9780140145632",
          "page_count": 675,
          "published_date": "1992",
          "publisher": "",
          "rating": "",
          "summary": "This is the biography of the English novelist and essayist George Orwell. Orwell is the author of Down and out in Paris, Homage to Catalonia, The Lion and the Unicorn and Nineteen Eighty-Four.",
          "thumbnail": "http://books.google.com/books/content?id=EMeeQgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "title": "George Orwell"
      },
      {
          "authors": "Gordon Bowker",
          "excerpt": "George Orwell was one of the greatest writers ...",
          "genres": "Authors, English",
          "isbn": "9780316861151",
          "page_count": 495,
          "published_date": "2003",
          "publisher": "Little Brown GBR",
          "rating": "",
          "summary": "George Orwell was one of the greatest writers England produced in the last century. He left an enduring mark on our language and culture, with concepts such as 'Big Brother' and 'Room 101.' His reputation rests not only on his political shrewdness and his sharp satires (Animal Farm and Nineteen Eighty-Four) but also on his marvellously clear style and superb essays, which rank with the best ever written. Gordon Bowker's new biography, written to coincide with Orwell's centenary, includes fascinating new material which brings his life into unfamiliar focus. He writes revealingly about Orwell's family background; the lasting influence of Eton on his work and character; his superstitious streak and youthful flirtation with black magic; and his chaotic and reckless sex life, which included at least one homoerotic relationship. It highlights the strange circumstances of his first marriage and provides remarkable new evidence of his experiences in Spain and their nightmarish consequences. It also offers a fresh look at his peculiar deathbed marriage to a woman fifteen years his junior. All this has enabled Bowker to give Orwell's life a brilliantly fresh and distinctive interpretation.",
          "thumbnail": "http://books.google.com/books/content?id=4wiFQgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "title": "George Orwell"
      },
      {
          "authors": "Mark Connelly",
          "excerpt": "George Orwell (1903-1950) is one of the most i...",
          "genres": "Literary Criticism",
          "isbn": "9781476634548",
          "page_count": 211,
          "published_date": "2018-10-24",
          "publisher": "McFarland",
          "rating": "",
          "summary": "George Orwell (1903-1950) is one of the most influential authors in the English language. His landmark novels Animal Farm (1945) and Nineteen Eighty-Four (1949) have been translated into many foreign languages and inspired numerous stage and film adaptations. His well-known essays \"A Hanging\" and \"Shooting an Elephant\" are widely anthologized and often taught in college composition classes. The writer is credited with inventing the terms \"Big Brother,\" \"thought crime,\" \"unperson\" and \"double think.\" His name itself has become an adjective--\"Orwellian.\" Seventy years after its publication, Nineteen Eighty-Four remains very popular, its sales surging in an era of enhanced surveillance and media manipulation. This literary companion provides an extensive chronology and more than 175 entries about both his literary works and personal life. Also included are discussion questions and research topics, notable quotations by Orwell and an extensive bibliography of related sources.",
          "thumbnail": "http://books.google.com/books/content?id=s_x0DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "George Orwell"
      },
      {
          "authors": "George Orwell",
          "excerpt": "...",
          "genres": "Essays",
          "isbn": "9780140182354",
          "page_count": 472,
          "published_date": "1984",
          "publisher": "",
          "rating": "",
          "summary": "",
          "thumbnail": "",
          "title": "The Penguin Essays of George Orwell"
      },
      {
          "authors": "John Rodden",
          "excerpt": "Is George Orwell the most influential writer w...",
          "genres": "Biography & Autobiography",
          "isbn": "9780691182742",
          "page_count": 376,
          "published_date": "2020-02-04",
          "publisher": "Princeton University Press",
          "rating": "",
          "summary": "Is George Orwell the most influential writer who ever lived? Yes, according to Rodden's provocative book about the transformation of a man into a myth. He charts the astonishing passage of a litterateur into a legend.",
          "thumbnail": "http://books.google.com/books/content?id=N8iXDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "Becoming George Orwell"
      },
      {
          "authors": "Jeffrey Meyers",
          "excerpt": "Anmeldelser m.m. fra litterære magasiner af: D...",
          "genres": "Literary Criticism",
          "isbn": "9780415159234",
          "page_count": 392,
          "published_date": "1997",
          "publisher": "Psychology Press",
          "rating": "",
          "summary": "Anmeldelser m.m. fra litterære magasiner af: Down and out in Paris and London ; Burmese days ; A clergyman's daughter ; Keep the aspidistra flying ; The road to Wigan Pier ; Homage to Catalonia ; Coming up for air ; Inside the whale ; The lion and the unicorn ; Animal farm ; Critical essays ; 1984 ; Shooting and elephant ; England your England ; Collected essays, journalism and letters.",
          "thumbnail": "http://books.google.com/books/content?id=WxE3mQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
          "title": "George Orwell"
      },
      {
          "authors": "George Orwell",
          "excerpt": "George Orwell was the author of some of the En...",
          "genres": "Fiction",
          "isbn": "9781443437219",
          "page_count": 2434,
          "published_date": "2014-05-06",
          "publisher": "Harper Collins",
          "rating": "",
          "summary": "George Orwell was the author of some of the English-language’s most recognized and debated modern fiction. With sharp prose and conflicted characters, Orwell’s writing critiqued social inequality and opposed totalitarianism. The Collected Works of George Orwell includes: Down and Out in Paris and London, Burmese Days, A Clergyman's Daughter, Keep the Aspidistra Flying,/em>, The Road to Wigan Pier, Homage to Catalonia, Coming Up for Air, Animal Farm, and the dystopian classic 1984. HarperPerennial Classics brings great works of literature to life in digital format, upholding the highest standards in ebook production and celebrating reading in all its forms. Look for more titles in the HarperPerennial Classics collection to build your digital library.",
          "thumbnail": "http://books.google.com/books/content?id=P3xlAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "The Collected Works Of George Orwell"
      },
      {
          "authors": "George Orwell",
          "excerpt": "globally known for his works: Animal Farm; 198...",
          "genres": "Biography & Autobiography",
          "isbn": "9786558945642",
          "page_count": 251,
          "published_date": "2024-07-04",
          "publisher": "Lebooks Editora",
          "rating": "",
          "summary": "globally known for his works: Animal Farm; 1984; Down and Out in Paris and London; Burmese Days; Keep the Aspidistra Flying, among others. Down and Out in Paris and London is a memoir of the most defining period of the author's life and his first work. It was upon its publication in 1933 that the pseudonym George Orwell was born, at the suggestion of his editor. After working as a British Empire police officer in Burma, George Orwell decided to understand the life, ways, and thoughts of the poor population and went to live as one of them. Orwell lived in destitution for a long time before finding work as a dishwasher in a hotel, and all the experiences he had in both cities resulted in this precious book. In Down and Out in Paris and London, Orwell discusses his times living in poverty in such a realistic and moving way that it is impossible to put the book down before finishing it.",
          "thumbnail": "http://books.google.com/books/content?id=7EcSEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "Down and Out in Paris and London"
      },
      {
          "authors": "Anita Croy",
          "excerpt": "George Orwell's 1984 had a major impact on the...",
          "genres": "Juvenile Nonfiction",
          "isbn": "9781534565920",
          "page_count": 66,
          "published_date": "2019-07-15",
          "publisher": "Greenhaven Publishing LLC",
          "rating": "",
          "summary": "George Orwell's 1984 had a major impact on the world when it was first released, and its themes of government surveillance, the threat of totalitarianism, and the suppression of information continue to resonate today. As readers are introduced to this novel and Orwell's other groundbreaking works of literature, including Animal Farm, they explore the many ways literature reflects the past and can help shape the future. Biographical details are presented through engaging main text, primary source images, and graphic organizers. Sidebars help readers closely analyze Orwell's work and think critically about how his themes are still relevant today.",
          "thumbnail": "http://books.google.com/books/content?id=n7nXDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "George Orwell"
      },
      {
          "authors": "Stephen Ingle",
          "excerpt": "This work assesses George Orwell's political w...",
          "genres": "Biography & Autobiography",
          "isbn": "9780719032332",
          "page_count": 168,
          "published_date": "1993",
          "publisher": "Manchester University Press",
          "rating": "",
          "summary": "This work assesses George Orwell's political writing, examining how his democratic socialism developed and changed in the 1930s and 40s. The book aims to determine whether Orwells' preoccupations form a common thread of coherent political philosophy.",
          "thumbnail": "http://books.google.com/books/content?id=XA_oAAAAIAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "George Orwell"
      },
      {
          "authors": "Loraine Saunders",
          "excerpt": "In a timely and radically new reappraisal of G...",
          "genres": "Literary Criticism",
          "isbn": "9781317012788",
          "page_count": 220,
          "published_date": "2016-02-24",
          "publisher": "Routledge",
          "rating": "",
          "summary": "In a timely and radically new reappraisal of George Orwell's fiction, Loraine Saunders reads Orwell's novels as tales of successful emancipation rather than as chronicles of failure. Contending that Orwell's novels have been undervalued as works of art, she offers extensive textual analysis to reveal an author who is in far more control of his prose than has been appreciated. Persuasively demonstrating that Orwell's novels of the 1930s such as A Clergyman's Daughter and Keep the Aspidistra Flying are no less important as literature than Animal Farm and Nineteen Eighty-Four, Saunders argues they have been victims of a critical tradition whose practitioners have misunderstood Orwell's narrative style, failed to appreciate Orwell's political stance, and were predisposed to find little merit in Orwell's novels. Saunders devotes significant attention to George Gissing's influence on Orwell, particularly with regard to his representations of women. She also examines Orwell's socialism in the context of the political climate of the 1930s, finding that Orwell, in his successful negotiation of the fine balance between art and propaganda, had much more in common with Charlie Chaplin than with writers like Stephen Spender or W. H. Auden. As a result of Saunders's detailed and accessible analysis, which illuminates how Orwell harmonized allegory with documentary, polyphonic voice with monophonic, and elegy with comedy, Orwell's contributions to the genre of political fiction are finally recognized.",
          "thumbnail": "http://books.google.com/books/content?id=ZhSgCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "The Unsung Artistry of George Orwell"
      },
      {
          "authors": "Keith Ferrell",
          "excerpt": "Born as Eric Blair in India in 1903, George Or...",
          "genres": "Juvenile Nonfiction",
          "isbn": "9781590773550",
          "page_count": 181,
          "published_date": "2014-03-24",
          "publisher": "Rowman & Littlefield",
          "rating": "",
          "summary": "Born as Eric Blair in India in 1903, George Orwell was a sickly child who was sent away to boarding school at age eight. Later he won a scholarship to Eton, where he was not a good student and earned a reputation as a rebel. Following Eton, he returned to Burma as a police officer, deliberately postponing his dream of becoming a writer. Orwell moved to Paris in 1928. He was concerned with the plight of the poor and was determined to find his own literary voice and themes. In the following years, he traveled and lived among the poor and unemployed. Orwell published several books and novels about his experiences, but success and recognition seemed slow in coming. In England, Orwell became known as an angry political writer and crusader for the left. He stood up for his convictions and fought in the Spanish Civil War, despite ill health. After this disillusioning experience, Orwell became an enemy of any form of totalitarianism. He tried to do his part for England under the Nazi siege through his journalism and broadcast scripts. Orwell completed Animal Farm during the war but was unable to find a publisher until the war was over. After the book’s enormous success in 1946, Orwell planned another novel set in the future ina totalitarian society. Writing from his house on the island of Jura in the Scottish Hebrides, he created the story of Winston Smith, who lived in a world where Big Brother was always watching. This was his masterpiece, Nineteen Eighty-Four. Orwell died soon after its publication, but not before witnessing its success. In a special epilogue, Ferrell deals with Orwell’s impact as a political moralist and the way in which the year 1984 has come to stand as a fearful symbol.",
          "thumbnail": "http://books.google.com/books/content?id=-zSsBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "George Orwell"
      },
      {
          "authors": "Richard Joseph Voorhees",
          "excerpt": "...",
          "genres": "Literature and society",
          "isbn": "9780911198805",
          "page_count": 132,
          "published_date": "1986",
          "publisher": "Purdue University Press",
          "rating": "",
          "summary": "",
          "thumbnail": "http://books.google.com/books/content?id=vMv1MXB7mK4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "The Paradox of George Orwell"
      },
      {
          "authors": "John Rodden",
          "excerpt": "The making of literary reputations is as much ...",
          "genres": "Literary Criticism",
          "isbn": "9781351517652",
          "page_count": 624,
          "published_date": "2017-09-04",
          "publisher": "Routledge",
          "rating": "",
          "summary": "The making of literary reputations is as much a reflection of a writer's surrounding culture and politics as it is of the intrinsic quality and importance of his work. The current stature of George Orwell, commonly recognized as the foremost political journalist and essayist of the century, provides a notable instance of a writer whose legacy has been claimed from a host of contending political interests. The exemplary clarity and force of his style, the rectitude of his political judgment along with his personal integrity have made him, as he famously noted of Dickens, a writer well worth stealing. Thus, the intellectual battles over Orwell's posthumous career point up ambiguities in Orwell's own work as they do in the motives of his would-be heirs. John Rodden's George Orwell: The Politics of Literary Reputation, breaks new ground in bringing Orwell's work into proper focus while providing much original insight into the phenomenon of literary fame.Rodden's intent is to clarify who Orwell was as a writer during his lifetime and who he became after his death. He explores the dichotomies between the novelist and the essayist, the socialist and the anti-communist and the contrast between his day-to-day activities as a journalist and his latter-day elevation to political prophet and secular saint. Rodden's approach is both contextual and textual, analyzing available reception materials on Orwell along with audiences and publications decisive for shaping his reputation. He then offers a detailed historical and biographical interpretation of the reception scene analyzing how and why did individuals and audiences cast Orwell in their own images and how these projected images served their own political needs and aspirations. Examined here are the views of Orwell as quixotic moralist, socialist renegade, anarchist, English patriot, neo-conservative, forerunner of cultural studies, and even media and commercial star. Rodden concludes with a consideration of the meaning of Or",
          "thumbnail": "http://books.google.com/books/content?id=fNwzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "George Orwell"
      },
      {
          "authors": "Harold Bloom",
          "excerpt": "Discusses the characters, plot, and writing of...",
          "genres": "Dystopias in literature",
          "isbn": "9781438128719",
          "page_count": 175,
          "published_date": "2009",
          "publisher": "Infobase Publishing",
          "rating": 4,
          "summary": "Discusses the characters, plot, and writing of Animal farm by George Orwell. Includes critical essays on the novel and a brief biography of the author.",
          "thumbnail": "http://books.google.com/books/content?id=V7C4bXGsrc8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
          "title": "George Orwell's Animal Farm"
      }
  ],
  "resultsCount": 24
}