{
    "message": "Found 24 books.",
    "results": [
        {
            "authors": "George Orwell",
            "excerpt": "A PBS Great American Read Top 100 Pick With ex...",
            "genres": "Fiction",
            "isbn": "9780547249643",
            "page_count": 309,
            "published_date": "2013-09-03",
            "publisher": "HarperCollins",
            "rating": 4.5,
            "summary": "A PBS Great American Read Top 100 Pick With extraordinary relevance and renewed popularity, George Orwell’s 1984 takes on new life in this edition. “Orwell saw, to his credit, that the act of falsifying reality is only secondarily a way of changing perceptions. It is, above all, a way of asserting power.”—The New Yorker In 1984, London is a grim city in the totalitarian state of Oceania where Big Brother is always watching you and the Thought Police can practically read your mind. Winston Smith is a man in grave danger for the simple reason that his memory still functions. Drawn into a forbidden love affair, Winston finds the courage to join a secret revolutionary organization called The Brotherhood, dedicated to the destruction of the Party. Together with his beloved Julia, he hazards his life in a deadly match against the powers that be. Lionel Trilling said of Orwell’s masterpiece, “1984 is a profound, terrifying, and wholly fascinating book. It is a fantasy of the political future, and like any such fantasy, serves its author as a magnifying device for an examination of the present.” Though the year 1984 now exists in the past, Orwell’s novel remains an urgent call for the individual willing to speak truth to power.",
            "thumbnail": "http://books.google.com/books/content?id=kotPYEqx7kMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "1984"
        },
        {
            "authors": "George Orwell",
            "excerpt": "A compilation of personal letters creates an a...",
            "genres": "Biography & Autobiography",
            "isbn": "9780871404626",
            "page_count": 569,
            "published_date": "2013-08-12",
            "publisher": "W. W. Norton & Company",
            "rating": -1.0,
            "summary": "A compilation of personal letters creates an autobiography of the author of \"Nineteen Eighty-Four\" through his correspondence with other literary luminaries, including T.S. Eliot and Henry Miller, as well as letters to complete strangers.",
            "thumbnail": "http://books.google.com/books/content?id=_WE4AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "George Orwell: A Life in Letters"
        },
        {
            "authors": "George Orwell",
            "excerpt": "Essays by the author of 1984 on topics from “r...",
            "genres": "Literary Collections",
            "isbn": "9780547417769",
            "page_count": 358,
            "published_date": "2009-10-14",
            "publisher": "HMH",
            "rating": -1.0,
            "summary": "Essays by the author of 1984 on topics from “remembrances of working in a bookshop [to] recollections of fighting in the Spanish Civil War” (Publishers Weekly). George Orwell was first and foremost an essayist, producing throughout his life an extraordinary array of short nonfiction that reflected—and illuminated—the fraught times in which he lived. “As soon as he began to write something,” comments George Packer in his foreword, “it was as natural for Orwell to propose, generalize, qualify, argue, judge—in short, to think—as it was for Yeats to versify or Dickens to invent.” Facing Unpleasant Facts charts Orwell’s development as a master of the narrative-essay form and unites such classics as “Shooting an Elephant” with lesser-known journalism and passages from his wartime diary. Whether detailing the horrors of Orwell’s boyhood in an English boarding school or bringing to life the sights, sounds, and smells of the Spanish Civil War, these essays weave together the personal and the political in an unmistakable style that is at once plainspoken and brilliantly complex. “Best known for his late-career classics Animal Farm and 1984, George Orwell—who used his given name, Eric Blair, in the earliest pieces of this collection aimed at the aficionado as well as the general reader—was above all a polemicist of the first rank. Organized chronologically, from 1931 through the late 1940s, these in-your-face writings showcase the power of this literary form.” —Publishers Weekly, starred review",
            "thumbnail": "http://books.google.com/books/content?id=uIL-qmlik4QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Facing Unpleasant Facts"
        },
        {
            "authors": "George Orwell",
            "excerpt": "This Excellent Collection brings together Orwe...",
            "genres": "Fiction",
            "isbn": "9786257287159",
            "page_count": 2100,
            "published_date": "2024-01-18",
            "publisher": "E-Kitap Projesi & Cheapest Books",
            "rating": -1.0,
            "summary": "This Excellent Collection brings together Orwell's longer, major books and a fine selection of shorter pieces. With great originality and wit Orwell unfolds his views on subjects ranging from a revaluation of Charles Dickens to the nature of Socialism, from a comic yet profound discussion of naughty seaside postcards to a spirited defence of English cooking. Displaying an almost unrivalled mastery of English plain prose, Orwell's Books created a unique literary manner from the process of thinking aloud and continue to challenge, move and entertain. This Books created and collected in George Orwell's Most important Works illuminate the life and work of one of the most individual writers of the XX century - a man who elevated political writing to an art. This Collection included: · 1984 · ANIMAL FARM · A CLERGYMAN'S DAUGHTER · BURMESE DAYS · COMING UP FOR AIR · DOWN AND OUT IN PARIS AND LONDON · HOMAGE TO CATALONIA · KEEP THE ASPIDISTRA FLYING · LOOKING BACK ON THE SPANISH WAR · THE LION AND THE UNICORN · THE ROAD TO WIGAN PIER",
            "thumbnail": "http://books.google.com/books/content?id=yDbuEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "George Orwell Collection"
        },
        {
            "authors": "George Orwell",
            "excerpt": "This is a classic tale of humanity awash in to...",
            "genres": "Literary Criticism",
            "isbn": "9781412811903",
            "page_count": 118,
            "published_date": "2009",
            "publisher": "Transaction Publishers",
            "rating": -1.0,
            "summary": "This is a classic tale of humanity awash in totalitarianism. A farm is taken over by its overworked, mistreated animals. With flaming idealism and stirring slogans, they set out to create a paradise of progress, justice, and equality. First published during the epoch of Stalinist Russia, today it is clear that wherever and whenever freedom is attacked, and under whatever banner, the cutting clarity and savage comedy of Orwell's masterpiece is a message still ferociously fresh.",
            "thumbnail": "http://books.google.com/books/content?id=73wp7OGyZbAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Animal Farm"
        },
        {
            "authors": "George Orwell",
            "excerpt": "George Orwell was a novelist, essayist and cri...",
            "genres": "Fiction",
            "isbn": "9786586079500",
            "page_count": 72,
            "published_date": "2020-06-18",
            "publisher": "LeBooks Editora ",
            "rating": -1.0,
            "summary": "George Orwell was a novelist, essayist and critic best known for his novels Animal Farm and Nineteen Eighty-Four. He was a man of strong opinions who addressed some of the major political movements of his times, including imperialism, fascism and communism. Animal Farm was published in 1945 when Orwell, a democratic socialist, was angered at Joseph Stalin for betraying the ideas of the Russian Revolution. In fact, that is the basis of Orwell's book. The characters in Animal Farm resemble significant people that impacted the Russian Revolution. These characters act similarly to the real people and actions that were done in the past. Through this book, George Orwell exposes Stalin's true nature and evils using a corrupt pig named Napoleon that eventually dictates the farm. Animal Farm is one of the most influential political texts ever written.",
            "thumbnail": "http://books.google.com/books/content?id=lyrsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "ANIMAL FARM - Orwell"
        },
        {
            "authors": "George Orwell",
            "excerpt": "...",
            "genres": "Essays",
            "isbn": "9780140182354",
            "page_count": 472,
            "published_date": "1984",
            "publisher": "",
            "rating": -1.0,
            "summary": "",
            "thumbnail": "",
            "title": "The Penguin Essays of George Orwell"
        },
        {
            "authors": "George Orwell",
            "excerpt": "George Orwell was the author of some of the En...",
            "genres": "Fiction",
            "isbn": "9781443437219",
            "page_count": 2434,
            "published_date": "2014-05-06",
            "publisher": "Harper Collins",
            "rating": -1.0,
            "summary": "George Orwell was the author of some of the English-language’s most recognized and debated modern fiction. With sharp prose and conflicted characters, Orwell’s writing critiqued social inequality and opposed totalitarianism. The Collected Works of George Orwell includes: Down and Out in Paris and London, Burmese Days, A Clergyman's Daughter, Keep the Aspidistra Flying,/em>, The Road to Wigan Pier, Homage to Catalonia, Coming Up for Air, Animal Farm, and the dystopian classic 1984. HarperPerennial Classics brings great works of literature to life in digital format, upholding the highest standards in ebook production and celebrating reading in all its forms. Look for more titles in the HarperPerennial Classics collection to build your digital library.",
            "thumbnail": "http://books.google.com/books/content?id=P3xlAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "The Collected Works Of George Orwell"
        },
        {
            "authors": "George Orwell",
            "excerpt": "globally known for his works: Animal Farm; 198...",
            "genres": "Biography & Autobiography",
            "isbn": "9786558945642",
            "page_count": 251,
            "published_date": "2024-07-04",
            "publisher": "Lebooks Editora",
            "rating": -1.0,
            "summary": "globally known for his works: Animal Farm; 1984; Down and Out in Paris and London; Burmese Days; Keep the Aspidistra Flying, among others. Down and Out in Paris and London is a memoir of the most defining period of the author's life and his first work. It was upon its publication in 1933 that the pseudonym George Orwell was born, at the suggestion of his editor. After working as a British Empire police officer in Burma, George Orwell decided to understand the life, ways, and thoughts of the poor population and went to live as one of them. Orwell lived in destitution for a long time before finding work as a dishwasher in a hotel, and all the experiences he had in both cities resulted in this precious book. In Down and Out in Paris and London, Orwell discusses his times living in poverty in such a realistic and moving way that it is impossible to put the book down before finishing it.",
            "thumbnail": "http://books.google.com/books/content?id=7EcSEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Down and Out in Paris and London"
        },
        {
            "authors": "George Orwell",
            "excerpt": "(Book Jacket Status: Jacketed) \"Nineteen Eight...",
            "genres": "",
            "isbn": "9780436350313",
            "page_count": 340,
            "published_date": "1987",
            "publisher": "Harvill Secker",
            "rating": -1.0,
            "summary": "(Book Jacket Status: Jacketed) \"Nineteen Eighty-Four\" revealed George Orwell as one of the twentieth century's greatest mythmakers. While the totalitarian system that provoked him into writing it has since passed into oblivion, his harrowing cautionary tale of a man trapped in a political nightmare has had the opposite fate: its relevance and power to disturb our complacency seem to grow decade by decade. In Winston Smith's desperate struggle to free himself from an all-encompassing, malevolent state, Orwell zeroed in on tendencies apparent in every modern society, and made vivid the universal predicament of the individual.",
            "thumbnail": "",
            "title": "Nineteen Eighty-four"
        },
        {
            "authors": "George Orwell",
            "excerpt": "Over the course of his career, George Orwell w...",
            "genres": "Literary Collections",
            "isbn": "9781328508713",
            "page_count": 223,
            "published_date": "2018-04-03",
            "publisher": "HarperCollins",
            "rating": 4.0,
            "summary": "Over the course of his career, George Orwell wrote about many things, but no matter what he wrote the goal was to get at the fundamental truths of the world. He had no place for dissemblers, liars, conmen, or frauds, and he made his feelings well-known. In Orwell on Truth, excerpts from across Orwell’s career show how his writing and worldview developed over the decades, profoundly shaped by his experiences in the Spanish Civil War, and further by World War II and the rise of totalitarian states. In a world that seems increasingly like one of Orwell’s dystopias, a willingness to speak truth to power is more important than ever. With Orwell on Truth, readers get a collection of both powerful quotes and the context for them.",
            "thumbnail": "http://books.google.com/books/content?id=p85DDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Orwell On Truth"
        },
        {
            "authors": "George Orwell",
            "excerpt": "'Shooting an Elephant' is Orwell's searing and...",
            "genres": "Biography & Autobiography",
            "isbn": "9780141187396",
            "page_count": 404,
            "published_date": "2009-06-04",
            "publisher": "Penguin UK",
            "rating": -1.0,
            "summary": "'Shooting an Elephant' is Orwell's searing and painfully honest account of his experience as a police officer in imperial Burma; killing an escaped elephant in front of a crowd 'solely to avoid looking a fool'. The other masterly essays in this collection include classics such as 'My Country Right or Left', 'How the Poor Die' and 'Such, Such were the Joys', his memoir of the horrors of public school, as well as discussions of Shakespeare, sleeping rough, boys' weeklies and a spirited defence of English cooking. Opinionated, uncompromising, provocative and hugely entertaining, all show Orwell's unique ability to get to the heart of any subject. A collection of witty and incisive non-fiction, George Orwell's Shooting an Elephant includes an introduction by Jeremy Paxman in Penguin Modern Classics.",
            "thumbnail": "http://books.google.com/books/content?id=NB4lDJqYOiMC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "Shooting an Elephant"
        },
        {
            "authors": "George Orwell",
            "excerpt": "Reprint. Originally published: New York: Harpe...",
            "genres": "Biography & Autobiography",
            "isbn": "9781105495953",
            "page_count": 171,
            "published_date": "2012-01-26",
            "publisher": "Lulu.com",
            "rating": -1.0,
            "summary": "Reprint. Originally published: New York: Harper & Brothers, 1933.",
            "thumbnail": "http://books.google.com/books/content?id=PN2SAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Down and Out in Paris and London"
        },
        {
            "authors": "George Orwell",
            "excerpt": "First of all the physical memories,The sounds,...",
            "genres": "Fiction",
            "isbn": "9786257120845",
            "page_count": 46,
            "published_date": "2023-11-27",
            "publisher": "E-Kitap Projesi & Cheapest Books",
            "rating": -1.0,
            "summary": "First of all the physical memories,The sounds, the smells and the surfaces of things. It is curious that more vividly than anything that came afterwards in the Spanish war I remember the week of so-called training that we received before being sent to the front - the huge cavalry barracks in Barcelona with its draughty stables and cobbled yards, the icy cold of the pump where one washed, the filthy meals made tolerable by pannikins of wine, the Trousered militia-women chopping firewood, and the roll-call in the early mornings where my prosaic English name made a sort of comic interlude among the resounding Spanish ones, Manuel Gonzalez, Pedro Aguilar, Ramon Fenellosa, Roque Ballaster, Jaime Domenech, Sebastian Viltron, Ramon Nuvo Bosch. I name those particular men because I remember the faces of all of them. Except for two who were mere riff-raff and have doubtless become good Falangists by this time, it is probable that all of them are dead. Two of them I know to be dead. The eldest would have been about twenty-five, the youngest sixteen. One of the essential experiences of war is never being able to escape from disgusting smells of human origin. Latrines are an overworked subject in war literature, and I would not mention them if it were not that the latrine in our barracks did its necessary bit towards puncturing my own illusions about the Spanish civil war. The Latin type of latrine, at which you have to squat, is bad enough at its best, but these were made of some kind of polished stone so slippery that it was all you could do to keep on your feet. In addition they were always blocked. Now I have plenty of other disgusting things in my memory, but I believe it was these latrines that first brought home to me the thought, so often to recur: 'Here we are, soldiers of a revolutionary army, defending Democracy against Fascism, fighting a war which is about something, and the detail of our lives is just as sordid and degrading as it could be in prison, let alone in a bourgeois army.' Many other things reinforced this impression later; for instance, the boredom and animal hunger of trench life, the squalid intrigues over scraps of food, the mean, nagging quarrels which people exhausted by lack of sleep indulge in.",
            "thumbnail": "http://books.google.com/books/content?id=I_HjEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "Looking Back on the Spanish War"
        },
        {
            "authors": "George Orwell,Peter Davison",
            "excerpt": "George Orwell was a tireless and lively corres...",
            "genres": "Authors, English",
            "isbn": "9781846553554",
            "page_count": 542,
            "published_date": "2010",
            "publisher": "",
            "rating": -1.0,
            "summary": "George Orwell was a tireless and lively correspondent. He communicated with family members, friends and newspapers, figures such as Henry Miller, Cyril Connolly, Stephen Spender and Arthur Koestler, and strangers who wrote to him out of the blue. This carefully selected volume of his correspondence provides an eloquent narrative of Orwell's life, from his schooldays to his final illness. Orwell's letters afford a unique and fascinating view of his thoughts on matters both personal, political and much in between, from poltergeists, to girls' school songs and the art of playing croquet. In a note home to his mother from school, he reports having 'aufel fun after tea'; much later he writes of choosing a pseudonym and smuggling a copy of Ulysses into the country. We catch illuminating glimpses of his family life: his son Richard's developing teeth, the death of his wife Eileen and his own illness. His talent as a political writer comes to the fore in his descriptions of Barcelona during the Spanish Civil War, his opinions on bayonets, and on the chaining of German prisoners. And of course, letters to friends and his publisher chart the development and publication of some of the most famous novels in the English language, providing unparalleled insight into his views on his own work and that of his contemporaries. A Life in Letters features previously unpublished material, including letters which shed new light on a love that would haunt him for his whole life, as well as revealing the inspiration for some of his most famous characters. Presented for the first time in a dedicated volume, this selection of Orwell's letters is an indispensible companion to his diaries.",
            "thumbnail": "http://books.google.com/books/content?id=BfJ0PgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "A Life in Letters"
        },
        {
            "authors": "George Orwell",
            "excerpt": "Animal Farm describes a revolution that takes ...",
            "genres": "Domestic animals",
            "isbn": "9784871872690",
            "page_count": 108,
            "published_date": "2017-04-13",
            "publisher": "Ishi Press",
            "rating": -1.0,
            "summary": "Animal Farm describes a revolution that takes place when the animals on a farm decide that they can run the farm better and more productively than the humans.",
            "thumbnail": "http://books.google.com/books/content?id=C6OMtAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "Animal Farm"
        },
        {
            "authors": "George Orwell",
            "excerpt": "...",
            "genres": "Fiction",
            "isbn": "9786258196955",
            "page_count": 0,
            "published_date": "2023-11-24",
            "publisher": "",
            "rating": -1.0,
            "summary": "",
            "thumbnail": "http://books.google.com/books/content?id=u-Zi0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "Animal Farm"
        },
        {
            "authors": "George Orwell,Peter Hobley Davison,Ian Angus,Sheila Davison",
            "excerpt": "The final paperback volume, Volume 20, of The ...",
            "genres": "Literary Collections",
            "isbn": "9780436210099",
            "page_count": 585,
            "published_date": "2002",
            "publisher": "Harvill Secker",
            "rating": -1.0,
            "summary": "The final paperback volume, Volume 20, of The Complete Works of George Orwell.",
            "thumbnail": "http://books.google.com/books/content?id=EK-6QgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "Our Job is to Make Life Worth Living"
        },
        {
            "authors": "George Orwell",
            "excerpt": "Collec. essays,journalism,letters of G. Orwell...",
            "genres": "Great Britain",
            "isbn": "9780140187113",
            "page_count": 624,
            "published_date": "1970",
            "publisher": "",
            "rating": -1.0,
            "summary": "Collec. essays,journalism,letters of G. Orwell.-v.1",
            "thumbnail": "http://books.google.com/books/content?id=X1JVPgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "The Collected Essays, Journalism and Letters of George Orwell: An age like this, 1920-1940"
        },
        {
            "authors": "George Orwell,Christopher Hollis,Eric Arthur Blair",
            "excerpt": "...",
            "genres": "",
            "isbn": "9781258000899",
            "page_count": 220,
            "published_date": "2011-04-01",
            "publisher": "",
            "rating": -1.0,
            "summary": "",
            "thumbnail": "http://books.google.com/books/content?id=iecLkgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "A Study of George Orwell"
        },
        {
            "authors": "George Orwell",
            "excerpt": "Containing The Road to Wigan Pier , Orwell's a...",
            "genres": "Fiction",
            "isbn": "9780141185170",
            "page_count": 643,
            "published_date": "2001-05-03",
            "publisher": "Penguin UK",
            "rating": -1.0,
            "summary": "Containing The Road to Wigan Pier , Orwell's account of poverty in Northern England, this title also includes The English People , in which he lists the nation's characteristics, and his essays on class, the horrors of private school life, and the merits of cricket, gardening and pubs.",
            "thumbnail": "http://books.google.com/books/content?id=sL3cOvAxgRsC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "Orwell's England"
        },
        {
            "authors": "George Orwell",
            "excerpt": "A collection of George Orwell's previously unp...",
            "genres": "Authors' spouses",
            "isbn": "9781857252149",
            "page_count": 0,
            "published_date": "2006",
            "publisher": "",
            "rating": -1.0,
            "summary": "A collection of George Orwell's previously unpublished letters, documents and photographs.",
            "thumbnail": "http://books.google.com/books/content?id=YeGTkQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "The Lost Orwell"
        },
        {
            "authors": "George Orwell",
            "excerpt": "Appearing for the first time in one volume, th...",
            "genres": "Biography & Autobiography",
            "isbn": "9780871406910",
            "page_count": 569,
            "published_date": "2013-08-12",
            "publisher": "W. W. Norton & Company",
            "rating": -1.0,
            "summary": "Appearing for the first time in one volume, these trenchant letters tell the eloquent narrative of Orwell’s life in his own words. From his school days to his tragic early death, George Orwell, who never wrote an autobiography, chronicled the dramatic events of his turbulent life in a profusion of powerful letters. Indeed, one of the twentieth century’s most revered icons was a lively, prolific correspondent who developed in rich, nuanced dispatches the ideas that would influence generations of writers and intellectuals. This historic work—never before published in America and featuring many previously unseen letters—presents an account of Orwell’s interior life as personal and absorbing as readers may ever see. Over the course of a lifetime, Orwell corresponded with hundreds of people, including many distinguished political and artistic figures. Witty, personal, and profound, the letters tell the story of Orwell’s passionate first love that ended in devastation and explains how young Eric Arthur Blair chose the pseudonym \"George Orwell.\" In missives to luminaries such as T. S. Eliot, Stephen Spender, Arthur Koestler, Cyril Connolly, and Henry Miller, he spells out his literary and philosophical beliefs. Readers will encounter Orwell’s thoughts on matters both quotidian (poltergeists and the art of playing croquet) and historical—including his illuminating descriptions of war-shattered Barcelona and pronouncements on bayonets and the immanent cruelty of chaining German prisoners. The letters also reveal the origins of his famous novels. To a fan he wrote, \"I think, and have thought ever since the war began…that our cause is the better, but we have to keep on making it the better, which involves constant criticism.\" A paragraph before, he explained that the British intelligentsia in 1944 were \"perfectly ready for dictatorial methods, secret police, systematic falsification of history,\" prefiguring the themes of 1984. Entrusting the manuscript of Animal Farm to Leonard Moore, his literary agent, Orwell describes it as \"a sort of fairy story, really a fable with political meaning…This book is murder from the Communist point of view.\" Hardly known outside a small circle of Orwell scholars, these rare letters include Orwell’s message to Dwight Macdonald of 5 December 1946 explaining Animal Farm; his correspondence with his first translator, R. N. Raimbault (with English translations of the French originals); and the moving encomium written about Orwell by his BBC head of department after his service there. The volume concludes with a fearless account of the painful illness that took Orwell’s life at age forty-seven. His last letter concerns his son and his estate and closes with the words, \"Beyond that I can’t make plans at present.\" Meticulously edited and fully annotated by Peter Davison, the world’s preeminent Orwell scholar, the volume presents Orwell “in all his varieties” and his relationships with those most close to him, especially his first wife, Eileen. Combined with rare photographs and hand-drawn illustrations, George Orwell: A Life in Letters offers \"everything a reader new to Orwell needs to know…and a great deal that diehard fans will be enchanted to have\" (New Statesmen).",
            "thumbnail": "http://books.google.com/books/content?id=WXGbfAHYecwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "title": "George Orwell: A Life in Letters"
        },
        {
            "authors": "George Orwell",
            "excerpt": "'All animals are equal, but some animals are m...",
            "genres": "Fiction",
            "isbn": "9781922148735",
            "page_count": 150,
            "published_date": "2014-01-02",
            "publisher": "Text Publishing",
            "rating": 5.0,
            "summary": "'All animals are equal, but some animals are more equal than others.' Drunken Mr Jones of Manor Farm has neglected his livestock for too long. In a burst of insurgent fervour they rise up and he is deposed, with the pigs taking charge of the newly named Animal Farm. Everything runs smoothly, productivity soars, and all animals are well-fed and happy. But the further away the memory of the revolution, the more distant seem its ideals, and when Boxer the workhorse is betrayed, the horrifying extent of the pigs' corruption is revealed. Orwell's 'fairy story', a scathing satire of Soviet communism, is as potent now as it was in 1945. Animal Farm is one of literature's most electrifying examinations of power and corruption. George Orwell, born Eric Arthur Blair (1903 - 1950) was a teacher, novelist and journalist. He also served his country, including in the Home Guard during the Second World War. He later became the literary editor of the Tribune and wrote for the Observer and Manchester Evening News. The author of nine books, Orwell is best know for the allegorical Animal Farm (1945) and dystopian satire Nineteen Eighty-Four (1949). They have gone on to become two of the most influential books of the twentieth century. 'A wise, compassionate, and illuminating fable.' New York Times 'There are no replacements for George Orwell, just as there are no replacements for a Bernard Shaw or a Mark Twain...he pricked, provoked and badgered lazy minds, delighted those who enjoyed watching an original intelligence at work.' Time 'A book for everyone and Everyman, its brightness undimmed after fifty years.' Ruth Rendell 'Timeless, even transcendent.' Christopher Hitchens 'Absolutely first rate.' New Yorker",
            "thumbnail": "http://books.google.com/books/content?id=tRgKAQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "title": "Animal Farm"
        }
    ],
    "resultsCount": 24
}